Revit 2024 API
ViewSchedule.IsValidCategoryForKeySchedule Method
 Checks whether a category can be used for a key schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsValidCategoryForKeySchedule(
	ElementId categoryId
)
Visual Basic
Public Shared Function IsValidCategoryForKeySchedule ( _
	categoryId As ElementId _
) As Boolean
Visual C++
public:
static bool IsValidCategoryForKeySchedule(
	ElementId^ categoryId
)
Parameters
categoryId
Type: Autodesk.Revit.DB.ElementId
 The category ID to check.
Return Value
 True if the category can be used for a key schedule, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace